import React, { useRef } from "react";
import styles from "./Container.module.scss";
import Section from "../components/Section.js";
import Footer from "../components/Footer.js";

const Detailing = () => {
	const section1 = useRef();
	const section2 = useRef();
	const section3 = useRef();
	const section4 = useRef();

	function scrollTo(section) {
		section.current.scrollIntoView({ behavior: "smooth" });
	}

	return (
		<>
			<div className={`${styles.container}`}>
				<div ref={section1}>
					<Section
						showArrow={true}
						scrollTo={scrollTo}
						goToSectionRef={section2}
					>
						<div
							className="firstPageTAG"
							style={{
								backgroundImage: 'url("..//img/cars/5.jpg")',
							}}
						>
							<div className="firstPageBox">
								<div className="content">
									<h1>Дeтейлінг</h1>
									<p>
										Автомобілістам добре знайоме миття транспортного засобу –
										власними силами, на мийці, автоматизоване або ручне. Але за
										допомогою стандартного миття неможливо позбутися від бруду,
										що скупчився в важкодоступних місцях, особливо якщо машина
										експлуатується в сільській місцевості або служить для
										регулярних перевезень. У таких ситуаціях буде потрібно
										детейлінг – комплекс заходів, призваний довести зовнішній
										вигляд і функціональний стан автомобіля до ідеалу. Це не
										звичайне миття, а професійне очищення кузова, салону, коліс
										та деталей транспортного засобу від забруднень та сміття.
									</p>
									<p>
										На відміну від миття, дітейлінг авто передбачає застосування
										спеціальних методів роботи та спеціальних миючих засобів.
										Ретельна обробка унеможливлює появу подряпин, тріщин і
										потертостей, які можуть зустрічатися при проведенні
										стандартних мийних процедур, особливо непрофесійних.
									</p>
									<p className="lasttextbox">
										Наша студія детейлінгу забезпечує збереження зовнішнього
										вигляду транспортного засобу та надання йому ідеальної
										чистоти від даху та капота до салону та колісних арок.
									</p>
								</div>
								<button onClick={() => scrollTo(section2)}>Детальніше</button>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section2}>
					<Section
						showArrow={true}
						scrollTo={scrollTo}
						goToSectionRef={section3}
					>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<h1 style={{ fontSize: "30px" }}>
										Залежно від стану машини власник може вибрати такі варіанти
										послуг:
									</h1>
									<p>
										<li>
											<b>Детейлінг зовнішніх частин автомобіля.</b> Виконується
											ручне миття за допомогою спеціалізованих препаратів,
											очищення бамперів, колісних арок та дисків, ручок, стекол,
											фар та підфарників. Після цього процедура доповнюється
											нанесенням герметиків, воску, а також полірування та інші
											дії. Детейлінг професійне полірування авто дозволяє
											сформувати найтонший захисний шар, який перешкоджає
											попаданню вологи, накопиченню пилу та бруду, надає блиску
											та доглянутого вигляду кузову.
										</li>
									</p>

									<p>
										<li>
											<b>Детейлінг салону. </b>
											Це чищення всіх внутрішніх елементів автомобіля, від стелі
											до підлоги, багажника, килимків, сидінь, висувних
											елементів, торпеди тощо. При цьому проводиться обробка
											пилососом, миття, чищення щіткою, упорядкування
											текстильної та шкіряної оббивки, ароматизація. Ретельна
											хімчистка салону, ціна якої залежить від вихідного стану
											автомашини, дозволяє повернути транспортному засобу вигляд
											авто, що тільки-но зійшов із заводського конвеєра
											незалежно від рівня забруднення.
										</li>
									</p>

									<p>
										Комплексний детейлінг включає чистку, миття і обробку як
										зовнішньої, так і внутрішньої частини автомобіля.
									</p>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section3}>
					<Section showArrow={false} scrollTo={scrollTo}>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<p>
										Відновлення транспортного засобу пропонується не всіма
										центрами. Ця процедура може забрати багато часу та сил. Вона
										частіше потрібна для авто, що зазнали значних навантажень,
										після ДТП або занадто інтенсивної експлуатації. Так що
										детелінг - це не просто полірування кузова автомобіля, але і
										безліч інших операцій, що повертають машині свіжість і
										чистоту. Вибір рівня обробки залежить від побажання
										замовника та стану транспорту.
									</p>
									<p>
										Тільки підготовлені майстри, які мають необхідний досвід та
										приладдя, можуть забезпечити високоякісний дітей-лінг машин
										на світовому рівні. Машина після обробки не просто сяє
										чистотою та свіжістю, вона захищена від негативного впливу
										навколишнього середовища. Майстри Auto Safe Culture
										виправляють невеликі дефекти, усувають подряпини та
										потертості, повертають машині вихідний вигляд, надають
										сяйва. Наша компанія ASC забезпечує всі види послуг для
										транспортних засобів різних марок і років випуску, як нових,
										так і тих, що побували в активній експлуатації. Професійний
										детейлінг, виконаний під ключ позбавляє власника авто від
										багатьох проблем на тривалий час. Спеціальне покриття,
										нанесене на фінальному етапі обробки, відштовхує вологу та
										інші опади, не дозволяє накопичуватися бруду та пилу.
										Завдяки цьому машина довго зберігає чистоту та глянцевий
										блиск, менше страждає від негативного впливу природи та
										міського середовища.
									</p>
									<p>
										Щоб отримати більш вичерпну консультацію та дізнатися
										вартість робіт залиште свій номер телефону і наш менеджер з
										вами зв'яжеться. Ціна формується на підставі обсягу та
										складності проведених робіт і початкового стану авто.
									</p>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section4}>
					<Section showArrow={false} goToSectionRef={section1}>
						<Footer />
					</Section>
				</div>
			</div>
		</>
	);
};

export default Detailing;
