import React from "react";
import Footer from "../components/Footer.js";
import Animation from "../components/Animation.js";

const FAQ = () => {
	const lastSection = React.useRef
	const [selectedItem, setSelectedItem] = React.useState(null);

	const handleClick = (item) => {
		setSelectedItem(selectedItem === item ? null : item);
	};

	return (
		<>
			<div
				className="firstPageFAQ"
				style={{
					backgroundImage: 'url("..//img/faq/faq1.jpeg")',
				}}
			>
				<div className="firstPageBox">
					<div className="content">
						<ul>
							<li
								className={`lili ${selectedItem === 1 ? "active" : ""}`}
								onClick={() => handleClick(1)}
							>
								1. На скільки збільшиться вага автомобіля після шумоізоляції?
								{selectedItem === 1 && (
									<p>
										Сучасні матеріали мають невелику вагу, в середньому після
										повної шумоізоляції додається 30-40 кг. Ви не відчуєте
										збільшення маси автомобіля і витрати палива.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 2 ? "active" : ""}`}
								onClick={() => handleClick(2)}
							>
								2. Який термін служби матеріалів для віброізоляції?
								{selectedItem === 2 && (
									<p>
										При дотриманні технології поклейки, встановленої виробником
										матеріалів, термін служби необмежений і перевищує термін
										служби автомобіля.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 3 ? "active" : ""}`}
								onClick={() => handleClick(3)}
							>
								3. Чи нешкідливі матеріали для здоров'я?
								{selectedItem === 3 && (
									<p>
										У виробника є всі дозволи та сертифікати відповідності
										нормам безпеки для здоров'я. Матеріали продаються у всьому
										світі і використовуються на заводах, під час виробництва
										авто та побутової техніки, наприклад, холодильників і
										кондиціонерів.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 4 ? "active" : ""}`}
								onClick={() => handleClick(4)}
							>
								4. Чому шумоізоляцію не роблять на заводі?
								{selectedItem === 4 && (
									<p>
										Взалежносі від марки автомобіля виробник наносить певну
										кількість шумоізоляції або не наносить її зовсім. Складання
										автомобіля на заводі займає в середньому 25 годин. Додаткова
										шумоізоляція - ручна праця, яку не можна автоматизувати, і
										займає близько 8 годин. Автовиробник не може піти на такі
										затримки у виробництві.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 5 ? "active" : ""}`}
								onClick={() => handleClick(5)}
							>
								5. Скільки займе часу весь процес обклеювання в захисну плівку?
								{selectedItem === 5 && (
									<p>
										Цей час залежить від поставленого завдання:
										<ul>
											<li className="divli">Бронювання фар займе 1 годину.</li>
											<li className="divli">
												Обклеювання нескладного бампера - 4 години.
											</li>
											<li className="divli">
												Обклеювання всього передка в чотири руки (два майстри) -
												8 годин, а поодинці не менше 12 годин.
											</li>
											<li className="divli">
												Повне обклеювання кузова займе від 2 до 4 днів.Час
												сильно залежить від складності кузова авто і обраної
												плівки.
											</li>
										</ul>
									</p>
								)}
							</li>{" "}
							<li
								className={`lili ${selectedItem === 6 ? "active" : ""}`}
								onClick={() => handleClick(6)}
							>
								6. Можна клеїти авто поступово?
								{selectedItem === 6 && (
									<p>
										Звичайно, можна спочатку поклеїти найважливіше: капот, фари,
										бампер. Потім, коли буде час і бажання - доклеїти решту.
										Взагалі, всі ці "комплекси": передок, повністю, зона ризику
										і таке інше - придумали маркетологи. Ніхто вам не забороняє
										обклеїти тільки бампер або тільки одну фару. У вас є машина,
										у нас є плівка. Вам потрібно захистити, а ми вміємо клеїти.
										Завжди домовимося.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 7 ? "active" : ""}`}
								onClick={() => handleClick(7)}
							>
								7. Можна плівку клеїти на відколи?
								{selectedItem === 7 && (
									<p>
										Умовно можна. Але варто розуміти, що плівка може приховати
										дрібні подряпини, але відколи залишаться видимими. Їх можна
										буде побачити. Якщо їх дуже багато, існує ризик, що повітря,
										залишене в них, з часом підірве плівку. У кожному випадку
										слід дивитися і приймати рішення індивідуально.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 8 ? "active" : ""}`}
								onClick={() => handleClick(8)}
							>
								8. Коли можна мити машину після обклеювання?
								{selectedItem === 8 && <p> Можна робити це через 6-8 годин.</p>}
							</li>
							<li
								className={`lili ${selectedItem === 9 ? "active" : ""}`}
								onClick={() => handleClick(9)}
							>
								9. Для чого потрібна сигналізація з автозапуском?
								{selectedItem === 9 && (
									<p>
										Автосигналізація з автозапуском користується водіями великою
										популярністю. Сьогодні життя диктує нові правила: техніка
										міцно увійшла в нашу повсякденність, щоб полегшити її.
										Сигналізація з автозапуском дозволить вам вмикати двигун
										машини дистанційно за допомогою брелока або телефону. Взимку
										- сідати в теплу машину. Влітку - в прохолодну. Автозапуск -
										це комфорт і економія часу водія.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 10 ? "active" : ""}`}
								onClick={() => handleClick(10)}
							>
								10. Що таке комплексне (авторське) встановлення?
								{selectedItem === 10 && (
									<p>
										Блок сигналізації ховається у важкодоступне місце автомобіля
										{">"} штатний комплект сигналізації доповнюється
										бездротовими блокуваннями (вмонтованими в штатну проводку){" "}
										{">"}
										встановлюються механічні захисні пристрої {">"} закладається
										автономний GPS-маяк = кожен елемент комплексу доповнює один
										одного і робить викрадення автомобіля практично неможливим.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 11 ? "active" : ""}`}
								onClick={() => handleClick(11)}
							>
								11. Що краще: штатний іммобілайзер чи сигналізація?
								{selectedItem === 11 && (
									<p>
										Ці дві системи являються доповненням один одного. Різниця
										між двома типами пристроїв полягає в принципах роботи і
										наборі функцій. Автосигналізація сповіщає власника
										транспортного засобу і привертає увагу оточуючих. Пристрій
										може налякати зловмисників або хуліганів і змінити вибір на
										аналогічне авто не оснащене сигналізацією. З іншого боку,
										іммобілайзери добре захищають транспортний засіб від
										викрадення, але водночас не можуть запобігти злому і
										крадіжці з салону автомобіля якщо заздалегідь підготовлений
										зловмисник вибрав Ваше авто.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 12 ? "active" : ""}`}
								onClick={() => handleClick(12)}
							>
								12. Що таке протиугінний комплекс?
								{selectedItem === 12 && (
									<>
										<p>
											Для того, щоб розібратися в цьому понятті, необхідно
											визначити, які цілі та завдання ставляться перед
											протиугінним комплексом і яким чином вони вирішуються.
										</p>
										<p>
											Так як же досягти цього, адже автомобілів, які не
											викрадають, не буває? Абсолютно вірно, авто, які не
											викрадаються, не буває. Тоді в чому ж сенс встановлювати
											протиугінний комплекс? Сенс полягає в тому, скільки часу
											зловмиснику необхідно для деактивації системи. І тут треба
											згадати, що крадіжка авто - це бізнес, а будь-який бізнес
											завжди оцінюється з точки зору ризиків. Так ось, займатися
											кілька годин з одним залізним конем стає дуже ризиковано,
											та й не дуже вигідно. Куди простіше кинути всі спроби, в
											сусідньому дворі знайти таке саме авто, де є лише штатний
											захист , та впоратися з роботою за кілька хвилин . З цього
											виходить, що завдання комплексу полягає в тому, щоб
											протистояти спробам злому протягом достатньо тривалого
											часу.
										</p>
									</>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 13 ? "active" : ""}`}
								onClick={() => handleClick(13)}
							>
								13. З чого складається протиугінний комплекс?
								{selectedItem === 13 && (
									<p>
										<li className="divli">
											В основі будь-якого ефективного протиугінного комплексу
											лежить сучасна, захищена від електронного злому система,
											що має можливість додавання додаткових елементів і
											модулів, які в сукупності забезпечують всій системі
											комплексність. Правильний комплекс будується за принципом
											створення декількох незалежних контурів захисту, у разі
											видалення будь-якого з елементів якого не призводить до
											краху всієї системи.
										</li>
										<li className="divli">
											Також кожен автомобіль має свої певні вразливості, так
											звані "лазівки", якими і користуються зловмисники. До
											таких вразливостей можна віднести наявність системи
											безключового доступу keyless, недосконалі штатні охоронні
											системи, вразливість алгоритму запису нових ключів в авто
											тощо. Завдання комплексу в зв'язку з цим не дати
											скористатися цими "лазівками".
										</li>
										<li className="divli">
											Не варто нехтувати також і механічними способами захисту.
										</li>
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 14 ? "active" : ""}`}
								onClick={() => handleClick(14)}
							>
								14. Що це таке незалежне блокування?
								{selectedItem === 14 && (
									<p>
										Це блокування, яке продовжує нести свій функціонал навіть у
										випадках демонтажу основного блоку системи.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 15 ? "active" : ""}`}
								onClick={() => handleClick(15)}
							>
								15.Що таке детейлінг полірування авто?
								{selectedItem === 15 && (
									<p>
										Детейлінг полірування кузова автомобіля - це процес обробки
										лакофарбового покриття з використанням спеціальних
										абразивних паст і полірувальних машин для усунення дрібних
										подряпин, потертостей, окислів та інших дефектів. Мета
										полірування - повернути автомобілю гладкість і блиск, а
										також поліпшити його зовнішній вигляд. Детейлінг полірування
										кузова авто - це не тільки естетична процедура, а й спосіб
										продовжити термін служби лако- фарбового автомобіля і
										зберегти його зовнішній вигляд у відмінному стані.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 16 ? "active" : ""}`}
								onClick={() => handleClick(16)}
							>
								16. Навіщо полірують фари і ліхтарі?
								{selectedItem === 16 && (
									<p>
										Згодом, на фарах автомобіля утворюються подряпини, жовтизна
										і матовість через вплив сонячних променів, пилу, бруду і
										хімічних реагентів. Такі проблеми зменшують
										світлопроникність фар, що знижує видимість на дорозі в
										темний час доби і позначається на безпеці їзди. Заміна фар
										на нові може коштувати дорого, особливо для колекційних
										моделей, фари яких зняті з виробництва або мають складну
										конструкцію. Полірування фар дає змогу усунути дефекти і
										продовжити термін служби фар без необхідності заміни на
										нові. Після полірування рекомендуємо нанести захисну
										антигравійну плівку.
									</p>
								)}
							</li>
							<li
								className={`lili ${selectedItem === 17 ? "active" : ""}`}
								onClick={() => handleClick(17)}
							>
								17.Що таке гідрофобний ефект?
								{selectedItem === 17 && (
									<p>
										Гідрофобність - фізична властивість молекули, "прагнення"
										уникнути контакту з водою. Для детейлінгу це означає брудо і
										водовідштовхувальний ефект. Завдяки спеціальним гідрофобним
										покриттям вода буквально скочується з оброблених поверхонь.
									</p>
								)}
							</li>
						</ul>
					</div>
				</div>
			</div>

			<Footer ref={lastSection}/>
		</>
	);
};

export default Animation(FAQ);
