import React, { useRef } from "react";
import Section from "../components/Section.js";
import styles from "./Container.module.scss";
import Footer from "../components/Footer.js";

const Save = () => {
	const section1 = useRef();
	const section2 = useRef();
	const section3 = useRef();
	const section4 = useRef();
	const section5 = useRef();
	const section6 = useRef();
	const section7 = useRef();
	const section8 = useRef();
	const section9 = useRef();
	const section10 = useRef();
	const section11 = useRef();

	function scrollTo(section) {
		section.current.scrollIntoView({ behavior: "smooth" });
	}

	return (
		<>
			<div className={`${styles.container}`}>
				<div ref={section1}>
					<Section
						showArrow={true}
						scrollTo={scrollTo}
						goToSectionRef={section2}
					>
						<div
							className="firstPageTAG"
							style={{
								backgroundImage: 'url("..//img/MercedesGT.jpg")',
							}}
						>
							<div className="firstPageBox">
								<div className="content">
									<h1>Системи захисту автомобіля від викрадення </h1>
									<p>
										Серед автовласників поширена думка, що будь-яку систему
										захисту можна знешкодити і доля правди в цьому є. Але існує
										один нюанс – час витрачений на викрадення. Як правило, коли
										зловмисник бачить, що викрадення потребує більше зусиль і
										часу, ніж потрібно – це його демотивує і змушує відмовитись
										від спроби угону. Найкраще рішення для безпеки вашого
										автомобіля – це комплексний підхід з декількох контурів
										захисту і оповіщення. Завдяки великому досвіду наших
										спеціалістів у нас в Auto Safe Culture ми підбираємо
										індивідуальні рішення під ваш автомобіль та в залежності від
										побажань автовласника. Для економії свого часу Ви можете
										попередньо ознайомитися з сучасними системами захисту і
										порівняти їх.
									</p>
								</div>
								<button onClick={() => scrollTo(section2)}>Детальніше</button>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section2}>
					<Section
						showArrow={true}
						scrollTo={scrollTo}
						goToSectionRef={section3}
					>
						<div
							className="thirdpage"
							style={{
								backgroundImage: 'url("..//img/cars/3.jpg")',
							}}
						>
							<div className="Box">
								<h1 style={{}}>Системи захисту від угону з GPS/GSM</h1>
								<p>
									Автомобільні сигналізації з вбудованими передатчиками сигналів
									GSM та GPS являються самим передовим рішенням в світі захисту
									автомобілів, адже дозволяють побудувати на їх базі найкращий
									комплекс охорони для Вашого авто за допомогою додаткових
									пристроїв, які можна підключити до сигналізації. Дані системи
									мають можливість підключення до електронної системи машини по
									цифровому каналу CAN і «бачити» всі компоненти автомобіля для
									максимальної безпеки.
								</p>
								<p>
									За рахунок вбудованого в систему захисту GSM модему Ваш
									смартфон перетворюється на повноцінний пульт керування
									охороною з самими сучасними функціями. Радіус дії такого
									пульта обмежується тільки покриттям мобільного зв’язку, тобто
									наглядати за своїм автомобілем і керувати охороною можна
									практично з будь-якої точки світу.
								</p>
							</div>
						</div>
					</Section>
				</div>{" "}
				<div ref={section3}>
					<Section
						showArrow={false}
						goToSectionRef={section4}
						scrollTo={scrollTo}
					>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<p>
										Для побудови комплексу охорони автомобіля з максимальним
										захистом використовуються такі додаткові пристрої як:
									</p>
									<ul>
										<li>
											<b>Антиджамер –</b> спеціальний пристрій, який виявляє
											роботу «глушилки» GSM сигналу. Коли поряд зафіксовано
											роботу такої «глушилки» ,антиджамер вмикає режим тривоги,
											блокує двигун і надсилає сповіщення Вам на смартфон.
										</li>
										<li>
											<b>Датчик об’єму в салоні -</b> пристрій, який за
											допомогою ультразвуку фіксує посторонні предмети в машині,
											якщо, наприклад, викрадач потрапив всередину через розбите
											скло.
										</li>
										<li>
											<b>Безпровідне радіо-реле –</b> ще один вид блокування,
											який дозволяє надійно захистити Ваш автомобіль від угону.
											Працює, як і звичайне реле, але зв’язується з основним
											блоком по радіоканалу. Завдяки даній функції та маленьким
											розмірам його можна абсолютно непомітно сховати в штатну
											проводку в будь-якому місці.
										</li>
									</ul>

									<p>
										Підведемо підсумок - системи захисту автомобіля від
										викрадення з вбудованими модемами GPS/GSM сигналів
										дозволяють створити самий надійний охоронний комплекс для
										Вашого «залізного коня».
									</p>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section4}>
					<Section
						showArrow={false}
						goToSectionRef={section5}
						scrollTo={scrollTo}
					>
						<div
							className="thirdpage"
							style={{
								backgroundImage: 'url("..//img/cars/6.jpg")',
							}}
						>
							<div className="Box">
								<h1 style={{ fontSize: "2.2vh" }}>
									Системи захисту з автозапуском
								</h1>
								<p>
									Взимку , коли двигуну авто потрібно більше часу на
									прогрівання, щоб зекономити власний час, можна скористатися
									функцією автозапуску. Сідайте в автомобіль вже з прогрітим
									двигуном і одразу вирушайте в дорогу!
								</p>
								<p>
									Сучасні автомобільні захисні системи дозволяють організувати
									дистанційний запуск двигуна авто за допомогою Вашого
									смартфону. Плюси таких систем - не лише економія Вашого часу
									та правильний догляд за двигуном в холодну пору але й
									гнучкість налаштування.
								</p>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section5}>
					<Section
						showArrow={false}
						goToSectionRef={section6}
						scrollTo={scrollTo}
					>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<p>
										Надійні системи захисту , які ми рекомендуємо мають наступні
										функції автозапуску:
									</p>
									<ul>
										<li>на певну кількість часу</li>
										<li>по напрузі акумулятора</li>
										<li>по температурі</li>
										<li>з певною періодичністю</li>
										<li>за розкладом</li>
									</ul>

									<p>
										При цьому захищеність лишається на найвищому рівні і у
										зловмисника нема можливості викрасти Ваш автомобіль навіть,
										коли двигун заведено. Всі автовласники, які зверталися до
										нас в <b>Auto Safe Culture</b> за даною функцією повністю
										відчули всі переваги користування автозапуском автомобіля.
										Скористайтеся цією можливістю і Ви !
									</p>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section6}>
					<Section
						showArrow={true}
						goToSectionRef={section7}
						scrollTo={scrollTo}
					>
						<div
							className="thirdpage"
							style={{
								backgroundImage: 'url("..//img/cars/7.jpg")',
							}}
						>
							<div className="Box">
								<h1 style={{ fontSize: "2.7vh" }}>Аналогові сигналізації </h1>
								<p>
									Основна відмінність аналогових систем від цифрових -
									відсутність модуля для підключення до електромережі автомобіля
									по цифровій шині CAN або LIN , що в свою чергу робить захист
									авто досить примітивним і не дозволяє вести моніторинг стану
									машини в реальному часі в будь-якому місці.
								</p>
								<p>
									Зазвичай такі автосигналізації встановлюють в машини
									бюджетного класу або ж коли власник залишає авто в тому місці,
									яке охороняється.
								</p>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section7}>
					<Section
						showArrow={true}
						goToSectionRef={section8}
						scrollTo={scrollTo}
					>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<p>
										У порівнянні аналогових систем захисту з цифровими через
										відсутність CAN шини вони мають більшу кількість дротів, що
										ускладнює встановлення сигналізації максимально приховано .
										Але не варто недооцінювати можливості таких
										автосигналізацій, адже маючи певний досвід, наші спеціалісти
										можуть забезпечити Вашу власність надійним захистом.
									</p>
									<b>Плюси даних систем:</b>
									<ul>
										<li>невисока вартість системи та встановлення</li>
										<li>оптимально підходить для бюджетних авто</li>
										<li>
											не дивлячись на деякі обмеження, можна забезпечити
											надійний захист за вигідною ціною
										</li>
									</ul>
									<b>Їх мінуси</b>
									<ul>
										<li>
											неможливо вести спостереження за станом авто в будь-якій
											точці світу
										</li>
										<li>
											мають деякі обмеження функціоналу по захисту і моніторингу
										</li>
										<li>
											простіше виявити через деякі обмеження по монтажу в
											порівнянні з цифровими системами
										</li>
									</ul>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section8}>
					<Section
						showArrow={true}
						goToSectionRef={section9}
						scrollTo={scrollTo}
					>
						<div
							className="thirdpage"
							style={{
								backgroundImage: 'url("..//img/cars/8.jpg")',
							}}
						>
							<div className="Box">
								<h1 style={{ fontSize: "2.5vh" }}>Імобілайзери</h1>
								<p>
									Імобілайзер — пристрій , який блокує запуск двигуна, тобто
									являється одним з видів захисту машини від викрадення. В
									сучасних авто він зазвичай вже встановлений з заводу і зчитує
									спеціальний чіп, який вмонтований в ключ. Якщо імобілайзер не
									розпізнає спеціальний чіп «мітку», то завести автомобіль
									неможливо.
								</p>
								<p>
									Мінусом даного рішення є той момент, що зловмисник може
									зробити копію ключа, підʼєднавшись до бортової системи авто,
									наприклад через діагностичний розʼєм OBD. Для уникнення даної
									ситуації встановлюються додаткові імобілайзери, чіпи яких
									неможливо підмінити, не маючи прямого доступу до них.
								</p>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section9}>
					<Section
						showArrow={true}
						goToSectionRef={section10}
						scrollTo={scrollTo}
					>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<p>
										Для комплексного підходу до захисту Вашого авто, електронні
										системи використовуються разом з механічними та
										електромеханічними засобами:
									</p>
									<p>
										<b>Електромеханічний замок капоту</b>, який захищає від
										проникнення в моторний відсік Вашого авто і не дає змоги
										дістатись до електронних засобів блокувань.Працює в парі з
										встановленою системою захисту або штатною системою авто.
									</p>

									<p>
										<b>Металевий кожух</b> на електронний блок управління та
										інші важливі вузли автомобіля. Запобігає заміні штатного
										блоку на заздалегідь підготовлений викрадачем, усуває
										можливість відключення ро’зємів для з’єднання з бортовою
										системою авто. Встановлюється з допомогою спеціальних
										зривних болтів, які неможливо відкрутити звичайними
										гайковими ключами
									</p>

									<p>
										<b>Закладний GPS трекер</b> з допомогою, якого можна
										відслідкувати місцезнаходження Вашого авто в в будь-якій
										точці світу завдяки технологіям GPS та LBS (позиціювання по
										GSM вишкам мобільних операторів) Має мініатюрні розміри,
										працює повністю автономно- це дає змогу сховати його в
										будь-якому місці автомобіля абсолютно непомітно для
										викрадача.
									</p>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section10}>
					<Section showArrow={false} goToSectionRef={section11}>
						<Footer />
					</Section>
				</div>
			</div>
		</>
	);
};

export default Save;
