import React, { useRef } from "react";
import Section from "../components/Section.js";
import styles from "./Container.module.scss";
import Footer from "../components/Footer.js";

const ZahysnaPlivka = () => {
	const section1 = useRef();
	const section2 = useRef();
	const section3 = useRef();
	const section4 = useRef();
	function scrollTo(section) {
		section.current.scrollIntoView({ behavior: "smooth" });
	}
	return (
		<>
			<div className={`${styles.container}`}>
				<div ref={section1}>
					<Section
						showArrow={true}
						scrollTo={scrollTo}
						goToSectionRef={section2}
					>
						<div
							className="firstPageTAG"
							style={{
								backgroundImage: 'url("..//img/cars/4.jpg")',
							}}
						>
							<div className="firstPageBox">
								<div className="content">
									<h1>Обклеювання захисною плівкою</h1>
									<p>
										Низька якість дорожнього покриття та наявність на ньому
										каменів, гравію та інших твердих предметів може призвести до
										того, що нова автомашина швидко покриється подряпинами, а
										крихкі деталі – скло, фари – можуть постраждати від ударів
										каменів, що вилетіли з-під коліс. Впоратися із ситуацією
										допоможе бронеплівка на автомобіль. Це захисне покриття, яке
										встановлюється або на окремі елементи автомобіля або на весь
										транспортний засіб. Воно дозволяє зберегти початковий
										зовнішній вигляд нової машини та врятує від наслідків
										небажаних контактів із різними абразивними речовинами, а
										також камінням, піском та брудом. Міцна захисна плівка на
										авто - це не просто спосіб запобігання пошкоджень, але і
										метод надання стильного сучасного вигляду. Це пов'язано з
										тим, що промисловість пропонує десятки варіантів плівок
										різної густини, кольору та рівня глянцю.
									</p>
									<p className="lasttextbox">
										Міцна антигравійна плівка на нову машину здатна захистити
										транспортний засіб від ударів дрібних каменів, негативного
										впливу дорожніх реагентів та недбалих дій під час миття.
										Вона продовжує блиск та ефектний вигляд фарби на тривалий
										період.
									</p>
								</div>
								<button onClick={() => scrollTo(section2)}>Детальніше</button>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section2}>
					<Section
						showArrow={true}
						scrollTo={scrollTo}
						goToSectionRef={section3}
					>
						<div
							className="secondPageTag"
							style={{
								backgroundImage: 'url("..//img/cars/3.jpg")',
							}}
						>
							<div className="boxContainer">
								<div className="textConteiner">
									<h1 style={{ fontSize: "30px" }}>
										Як користуватися захисною плівкою.
									</h1>
									<p>
										Антигравійна плівка та обклеювання нею транспортного засобу
										може бути різною. Сама плівка має товщину всього в 150
										мікрон, вона зовсім непомітна на поверхнях, але робить їх
										значно міцнішими. Вона може бути глянсовою та матовою,
										прозорою або чорною. Вибір плівки залежить від того, на які
										деталі та частини її планується наносити.
									</p>
									<p>
										Обклеювання та бронювання авто поліуретановою плівкою може
										виконуватися частково або повністю. Залежно від побажання
										власника і пропонуються такі варіанти:
									</p>
									<ul>
										<li>
											<p>
												<b>Стартовий</b> – покриття наноситься на пороги, ручки,
												передні фари та іншу оптику.
											</p>
										</li>
										<li>
											<p>
												<b>Стандарт</b>. Захист використовується для переднього
												бампера, частково – капота та передніх крил, передніх та
												протитуманних фар, а також дзеркал та ручок.
											</p>
										</li>
										<li>
											<p>
												<b>Стандарт+</b> відрізняється від попереднього варіанта
												повним покриттям капота.
											</p>
										</li>
										<li>
											<p>
												<b>Стандарт ++</b>. В цьому випадку бронеплівка на кузов
												наклеюється на весь капот і крила.
											</p>
										</li>
										<p>
											Також можливе використання повного обклеювання автомобіля.
											В основному це використовується для авто високої цінової
											категорії, цінних брендів та марок, ремонт яких
											коштуватиме набагато дорожче, ніж бронювання кузова
											захисною плівкою.
										</p>
									</ul>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section3}>
					<Section
						showArrow={false}
						goToSectionRef={section4}
						scrollTo={scrollTo}
					>
						<div className="secondPageTag">
							<div className="boxContainer">
								<div className="textConteiner">
									<p>
										Щоб виконати покриття авто захисною плівкою, необхідно
										вирішити, в якому обсязі буде виконуватися нанесення і
										підібрати необхідний варіант. Цей процес краще довірити
										професіоналам з профільними знаннями та вміннями, досвідом
										проведення подібних робіт, а також, якщо вони володіють
										необхідними інструментами.
									</p>
									<p>
										Майстри Auto Safe Culture з відповідним досвідом роботи
										підкажуть кращі варіанти захисту транспортного засобу
										замовника, підберуть оптимальні матеріали та швидко
										виконають необхідні роботи. Професійне покриття авто
										захисною поліуретановою плівкою для власника транспортного
										засобу означає повну безпеку від можливих пошкоджень під час
										експлуатації, збереження якості та виду лакофарбового шару
										та металу кузова, прозорості пластику та скла на оптиці,
										міцності пластикових елементів, а також захист від корозії.
										Наша компанія ASC гарантує якість та швидкість виконання
										робіт, відмінні технічні характеристики використовуваних
										плівок та тривалий термін служби покриття.
									</p>
								</div>
							</div>
						</div>
					</Section>
				</div>
				<div ref={section4}>
					<Section showArrow={false} goToSectionRef={section1}>
						<Footer />
					</Section>
				</div>
			</div>
		</>
	);
};

export default ZahysnaPlivka;
